text1="""
Предисловие Толстой писал роман о декабристах (были написаны три первые главы). Роман строился на противопоставлении людей старого времени, декабря, 
с их энергией и молодостью души, нынешнему апатичному поколению. (Такого рода антитеза ранее встречалась в «Двух гусарах».) Главный герой романа, вернувшийся из
сибирской ссылки Пьер Лабазов, и его жена Наташа напоминают будущих героев «Войны и мира» – Пьера Безухова и Наташу Ростову.

Корни событий декабря автор романа увидел в событиях Отечественной войны 1812 г. – времени духовного пробуждения русского народа, единения дворянства и 
простых людей в борьбе с иноземным врагом. Но изображать победоносную и славную для русского оружия войну 1812 г., не упоминая о проигранных русскими кампаниях 1805 
и 1807 г., Толстой считал нечестным. Так возник замысел романа “Война и мир”. Роман писался и перерабатывался Толстым на протяжении 1863–1869 гг. (издан в 1865–1869 
гг., в изданиях 1873 и 1886 гг. в текст были внесены некоторые изменения)[1 - Начало будущего романа, озаглавленное «1805 год», было напечатано в журнале М.Н. Каткова
 «Русский вестник» (1865. № 1, 2; 1866. № 2, 3, 4, 5). Это будущий первый том. В первом издании 1867–1869 гг. текст «Войны и мира» был разделен на 6 томов, в 1868–1869 
 гг. было напечатано второе отдельное издание, в текст романа автор внес некоторые стилистические изменения. В 1873 г. в третьем издании «Войны и мира» текст был
  разделен на четыре тома, а историко-философские главы вынесены в отдельное приложение, названное «Статьи о кампании 1812 года»; было удалено большинство французских 
  реплик из речей персонажей. В издании 1886 г. эти главы были вновь внесены в основной текст книги, а французская речь восстановлена. (Издание осуществлялось, однако, 
  практически без участия автора, после духовного перелома начала 1880-х гг. утерявшего прежний интерес к своему творчеству; текст готовила С.А. Толстая, ее 
  консультировал критик Н. Н. Страхов.) Большинство текстологов – исследователей творчества Толстого признают каноническим текст изданий 1868–1869 и 1886 гг., но с
   учетом стилистической правки в издании 1873 г. Именно так напечатан роман в Полном собрании сочинений в 90 т. (т. 9-12, два тиража: 1930–1933; 1937–1940) и 
   (с существенными исправлениями) в Собрании сочинений в 20 т. (т. 4–7, 1961–1963). Этот текст воспроизведен в издании: Толстой Л. Н. Собрание сочинений: В 22 т.
   М., 1979–1981. Т. 4–7.Однако это решение признается не всеми текстологами. Известный исследователь творчества Л.Н. Толстого Н.К. Гудзий полагал, что каноническим
    должно считать текст издания 1873 г. – последнего отражающего авторскую волю.].

На протяжении семи лет работы над романом замысел Толстого претерпевал серьезные изменения. Было отброшено первоначальное заглавие «Три поры», отражающее намерение 
изобразить такие эпохи, как период войн с Наполеоном, время декабристского движения и 1856 г., год возвращения сосланных декабристов из Сибири. Центром произведения 
становились события 1812 г. Отказался автор и от более позднего заглавия «Все хорошо, что хорошо кончается», рождающего ненужные ему ассоциации с традиционным семейным 
романом со счастливой развязкой и с историческими романами в духе В. Скотта, завершавшимися свадьбой героя и героини. В рукописи произведения конца 1867 г. наконец 
появляется всем известное название «Война и мир» – но слово «мip» здесь написано через «i», «мiр» (в печатном же тексте было написание «мир»). В отличие от слова «мир», 
означающего отсутствие войны, «мiр» значило «вселенная, род людской, общество»[2 - Даль В. Толковый словарь живого великорусского языка. М., 1995. Т. 2. И-О. С.
 330–331.]. В заглавии романа это слово многозначно, сохраняя смыслы, присущие и «миру», и «мiру».

Кутузов, лукавый царедворец, каким его первоначально хотел изобразить Толстой, превратился в величественного и простого «старого человека», стал символом эпохи 1812 г. 
Эта перемена совершилась, по признанию автора, под влиянием общения с крестьянскими детьми в Яснополянской школе: для детей фельдмаршал был «свой», любимый «дедушка». 
Очень непохож в планах и ранних редакциях романа «молодой человек» – офицер, будущий князь Андрей Болконский. Первоначально Толстой предполагал описать его гибель в 
Аустерлицком сражении, затем отказался от этого намерения. Также очень переменились по мере работы автора над романом Анна Павловна Шерер и княгиня Друбецкая (вначале 
изображенные с симпатией), Наташа Ростова (в образе которой еще не было чарующей и пленительной поэтичности), Пьер Безухов (первоначально не бывший любимым героем Толс
того)[3 - О творческой истории «Войны и мира» см. прежде всего: Зайденшнур Э. Е. «Война и мир» Л.Н. Толстого: Создание великой книги. М., 1966, а также статью Э. Е. За
йденшнур в 16-ом т. Полного собрания сочинений в 90 т. (с. 19-141) и статью Г. В. Краснова и Н.М. Фортунатова в 7-ом томе Собрания сочинений в 22 т. (с. 367–401). Списо
к основной литературы о «Войне и мире» (научные исследования, научно-популярные книги, пособия для учителей, книги-комментарии) см. в изд.: Война из-за «Войны и мира»: 
Роман Л.Н. Толстого в русской критике и литературоведении. СПб., 2002. С. 475–476.].

Работа над романом была проделана грандиозная. Изменения вносились даже в последний момент, в корректуру. В ответ на сетования издателя П. И. Бартенева автор признавался
: «Не марать так, как я мараю, я не могу, и твердо знаю, что маранье это идет в великую пользу… То именно, что вам нравится, было бы много хуже, ежели бы не было раз 5 п
еремарано».



«Война и мир» мало похожа на классический роман. Автор в статье «Несколько слов по поводу книги “Война и мир”» (1868) противопоставлял свое произведение и роману, и поэм
е (очевидно, подразумевая поэму в прозе, наподобие «Мертвых душ» Н.В. Гоголя), и исторической хронике: «“Война и мир” есть то, что хотел и мог выразить автор в той форм
е, в которой оно выразилось». Толстой предпочитал называть свое произведение просто «книгой». В ней нет традиционного любовного треугольника, любовного или социального к
онфликта как основы сюжета. Обычно ключевыми элементами романа – кульминацией или развязкой – были дуэль, женитьба или смерть персонажей. Не так у Толстого. Роман заканч
ивается не описанием свадьбы Пьера и Наташи или Николая и Марьи, а, казалось бы, случайной сценой – изображением сна Николеньки, сына князя Андрея. В этом сне соединилис
ь в одно лицо два главных героя – князь Андрей и Пьер Безухов, и сон предвещает бедствия Пьера – будущего декабриста. Этот странный, необычный роман имеет открытый финал
 – будущее семьи Пьера и Наташи неизвестно и лишь смутно угадывается. Не внешние перемены в судьбах героев, а их духовная эволюция, их нравственные поиски составляют под
 линное содержание “Войны и мира”.

Две основные линии “Войны и мира” – история двух друзей – Пьера Безухова и Андрея Болконского. Две эти линии соединяет образ юной графини Наташи Ростовой – невесты князя
 Андрея, позднее, спустя время после его смерти, – жены Пьера[4 - «<…> [Д]ве главные семьи романа представляют много общего с предками Л<ьва> Н<иколаеви>ча как со сторон
 ы матери, так и со стороны отца.“Наташа”, и то почти списана Л. Н. с натуры. Много черт в нее вошло из типа его свояченицы, меньшой сестры графини, теперь Татьяны Андре
 евны Кузминской; вошли также в нее и черты графини С<офьи> А<ндреевны>. По ее словам, Л<ев> Н<иколаеви>ч так выражался про Наташу: “Я взял Таню, перетолок ее с Соней, и
  вышла Наташа». – Бирюков П. И. Биография Льва Николаевича Толстого. Изд. 3-е, испр. и доп. М.; Пг., 1923. Т. 2. С. 16.]. Черта любимых героев Толстого – способность к 
  движению и к духовному росту. И Пьер, и князь Андрей освобождаются от ложных идей благодаря общению с простыми русскими людьми. Для князя Андрея это капитан Тушин и по
  дчиненные ему солдаты-артиллеристы, с которыми Андрей познакомился в сражении с Наполеоном при Шенграбене. Пьеру высшую ценность простоты открывают солдаты, которых он
   видит на Бородинском поле. Солдат Платон Каратаев помогает понять Пьеру, что смысл жизни – в ней самой, в ее простых и естественных радостях, в интуитивном доверии к 
   жизни, в смиренном приятии выпадающих ему бед.

Естественность в романе Толстого противопоставлена ложной, поверхностной жизни. Проста и естественна Наташа Ростова – юная “графинечка”, самозабвенно исполняющая русски
й народный танец. Просты, чужды актерства и фальши русские солдаты, совершающие подвиги по-будничному, без единой мысли о славе. Прост русский полководец Кутузов, олицет
воряющий, как и Платон Каратаев, полноту обретенного смысла жизни. К этой простоте, к освобождению от мелких и эгоистических чувств движутся и Андрей, и Пьер. Андрей, см
ертельно раненный при Бородине, обретает бесконечную любовь ко всем людям, а затем, накануне кончины, – полную отрешенность от всех земных забот и волнений, высшую умиро
творенность. Открытая им истина любви к Богу неотмирна, и, зная ее, герой может только умереть. Эта истина беспечальная, рождающая спокойно-равнодушное отношение к людям
, к земным привязанностям, к оставляемой временной жизни[5 - «Какая простая и поистине прекрасная, неподражаемая картина смерти! Ни в прозе, ни в стихах мы не знаем ниче
го равного этому описанию. <…>… [Э]то тихое и спокойное “пробуждение от сна жизни”. Глядя таким взглядом на смерть, умирать не страшно. Человек уходит отсюда, и это хоро
шо. И чувствуешь, что это хорошо, и окружающие это чувствуют, что это в самом деле хорошо, что это прекрасно. Одно это представление дает нам чувствовать в миросозерцани
и автора нечто иное, не похожее на мировоззрение целой плеяды других наших писателей <…>», – написал об этом Н. С. Лесков в статье «Герои Отечественной войны по гр. Л. Н
. Толстому» (1869). – Лесков Н. С. Собрание сочинений: В 11 т. М., 1958. Т. 10. С. 101–102.Анализу предсмертных мыслей и умирания князя Андрея в сопоставлении с религиоз
ными мотивами других сочинений Л. Н. Толстого посвящена книга Б. Бермана «Сокровенный Толстой» (М., 1992).].

Пьер находит покой и счастье в тихой семейной жизни с Наташей. Но его искания не окончились: разочаровавшийся в одном «кружке», в масонстве, герой Толстого теперь погруж
ается в деятельность тайного общества. Не очевидно, что этот выбор безусловно истинен. Но важно само движение Пьера к правде. В 1857 г. Толстой занес в дневник запись: «
Истина в движеньи – только». Судьба Пьера – воплощение этой мысли.

Любимым персонажам Толстого противопоставлен великий позер Наполеон, увлеченно играющий роль “великого человека”. Его напоминают многочисленные “наполеоны” и “наполеончи
ки” – русский император Александр I, сановник Сперанский, фрейлина Анна Шерер, семейство Курагиных, разыгрывающие любовь карьерист Борис Друбецкой и расчетливая Жюли Кар
агина и многие другие. Эти персонажи наделены преувеличенным представлением о собственном значении, они внутренне пусты и бесчувственны. Они испытывают жажду славу, чист

о плотскую страсть, заботятся о карьере, любят красиво и много говорить. И они не знают любви к ближнему, не чувствуют высшего смысла жизни.

Роман Толстого моралистичен, и автор вершит над героями свой строгий и неотменяемый суд: утратой власти наказан Наполеон; смертью детей – Элен и Анатоля – князь Василий 
Курагин и его супруга. Семейство Курагиных вымарывается, истребляется со страниц книги бытия, в то время как Николаю и Марье Ростовым, Пьеру и Наташе Безуховым создатель 
романа дарует долгую жизнь, счастливое отцовство и материнство.

Однако автор «Войны и мира» судит героев с некоей особенной позиции, далекой от традиционного нравственного ригоризма. Отзывчивая, благодарная, милая Соня обречена на ве
чное девичество не потому, что дурна душевно, но потому что лишена жизненной силы, являясь, по словам Наташи, «пустоцветом». Толстому симпатичен заурядный Николай Ростов,
 живущий, как заведено в той среде, с которой он себя отождествляет. (Это, прежде всего, гусарское «братство».) Симпатичен энергией, страстью, волей к жизни. Этическое в 
 «Войне и мире» во многом производно от витального, от этой любви к бытию и к его радостям.

Любимые герои писателя далеко не идеальны. Наташа, сначала по-детски влюбленная в Бориса Друбецкого, потом полюбившая князя Андрея и почти сразу увлеченная чувственной с
трастью к Анатолю, а вскоре после того испытывающая зарождающуюся любовь к Пьеру, внешне напоминает любвеобильную Элен. Кутежи и разврат Пьера, казалось бы, похожи на по
ступки Долохова или Анатоля, как и «гусарство» Николая Ростова или Денисова. Но за внешним сходством таится различие. Душевная широта, открытость, причастность через стр
асть, через азарт к полноте бытия противопоставлены душевной ограниченности, самовлюбленности, притворству.

Не идеален в изображении Толстого и народ. Хозяин постоялого двора Ферапонтов, поджигающий дом, чтобы он не достался французам (и это для автора поступок, исполненный ши
роты и даже величия), жестоко «в патриотическом озверении» избивает жену, предложившую до прихода Наполеона покинуть Смоленск. Против Наполеона поднимается «дубина народ
ной войны». Но богучарские мужики бунтуют, не желая отпускать свою госпожу (совсем не тиранку), и хотят приветствовать «освободителя Наполеона». Единому чувству, «скрыто
й теплоте патриотизма», согревающей души солдат перед Бородинским сражением, противопоставлена тупая, дикая ярость толпы, дерущейся за царские бисквиты или забивающей на
смерть несчастного «шпиона» Верещагина.




В романе Толстого уравнены в своем значении исторические сцены и сцены частной, семейной жизни. Толстой одинаково подробно описывает Аустерлицкое сражение, битву при Бо
родине, военный совет штаба русской армии в Филях и первый бал Наташи Ростовой, охоту старого графа Ростова и разговоры Пьера и Наташи о здоровье детей. “Исторические” 
главы в “Войне и мире” чередуются с “семейными”. Толстой воспринимает происходящее именно с точки зрения частного, “постороннего” человека, а не с точки зрения полковод
ца или государственного деятеля. Так, Бородинское сражение увидено глазами штатского человека – Пьера Безухова, ничего не понимающего в военной науке.

«Ослепительная сторона романа именно и заключается в естественности и простоте, с какими он низводит мировые события и крупные явления общественной жизни до уровня и гор
изонта зрения всякого выбранного им свидетеля. Великолепная картина Тильзитского свидания, например, вращается у него, как на природной оси своей, около юнкера или корне
та, графа Ростова, ощущения которого по этому поводу составляют как бы продолжение самой сцены и необходимый к ней комментарий. Без всякого признака насилования жизни и 
обычного ее хода роман учреждает постоянную связь между любовными и другими похождениями своих лиц и Кутузовым, Багратионом, между историческими фактами громадного значе
ния, Шенграбеном, Аустерлицем и треволнениями московского аристократического кружка, будничный строй которого они не в состоянии одолеть, как не в состоянии одолеть и ве
чных стремлений человеческого сердца к любви, деятельности, наслаждению», – так отметил эти черты романа критик П. В. Анненков[6 - Анненков П. В. Исторические и эстетиче
ские вопросы в романе гр. Л. Н. Толстого «Война мир» // Война из-за «Войны и мира». С. 46–47.].


В представлении Толстого частная, семейная жизнь обыкновенных людей – такое же историческое событие, достойное внимания историка и писателя не меньше, чем переговоры цар
ей и дипломатов или военные победы. «Для Толстого, – замечает исследователь “Войны и мира” С. Г. Бочаров, – предметы и эпизоды в романе не распределяются по степени знач
имости в зависимости от того, изображают ли они домашний быт или историческое событие. В “Войне и мире” Толстой как раз развенчал историю, отделенную от простого быта лю
дей, и всю вообще искусственную иерархию исторической и частной жизни как явлений высшего и низшего ранга. У Толстого, опровергающего привычку расценивать вещи по рангам
, привитую людям официальным обществом, принципиально соизмеримы и равноценны в своей значительности сцены семейные и исторические, и само разделение это еще очень внешн
ее, хотя оно и напрашивается. <…> Существует, по Толстому, единая жизнь людей, ее простое и общее содержание, коренная для нее ситуация, которая может раскрыться так же 
глубоко в событии бытовом и семейном, как и в событии, которое называется историческим. Эпизоды “Войны и мира” связаны между собой прежде всего не единством действия, в
 котором участвуют одни и те же герои, как в обычном романе; эти связи имеют вторичный характер и сами определяются другой, более скрытой, внутренней связью. С точки зр
 ения поэтики романа, действие в “Войне и мире” очень несосредоточенно и несобранно. Оно развивается параллельными линиями; связь внутренняя, составляющая “основу сцепле
 ния”, заключается в ситуации, основной ситуации человеческой жизни, которую вскрывает Толстой в самых разных ее проявлениях и событиях»[7 - Бочаров С. Г. Роман Л. Толст
 ого «Война и мир // Война из-за «Войны и мира». С. 358–359. О поэтике соотнесенности сюжетных линий и эпизодов в «Войне и мире» см. также: Камянов В.И. Поэтический мир 
 эпоса: О романе Л. Толстого «Война и мир». М., 1978. Связь историософских глав и сюжетного повествования прослежена А. А. Сабуровым: Сабуров А. А. «Война и мир» Л.Н. То
 лстого: Проблематика и поэтика. М., 1959.].

Понимание Толстым исторического значения частной жизни отчетливо выражено в строках об «истории-искусстве», написанных уже после окончания «Войны и мира»: «История-иску
сство, как и всякое искусство, идет не вширь, а вглубь, и предмет ее может быть описание жизни всей Европы и описание месяца жизни одного мужика в XVI веке».

«Официальную» историю «великих людей» Толстой беспощадно изобличает. Работая над романом, он записывает в дневник: «Я зачитался историей Наполеона и Александра. Сейчас 
меня облаком радости сознания возможности сделать великую вещь охватила мысль написать психологическую историю: роман Александра и Наполеона. Всю подлость, всю фразу, в
се безумие, все противоречие людей, их окружавших, и их самих». Исторические сочинения и мемуары Толстой штудировал внимательнейшим образом. Как он писал без всякого пр
еувеличения: «Везде, где в моем романе говорят и действуют исторические лица, я пользовался материалами, из которых у меня во время моей работы образовалась целая библи
отека книг, заглавия которых я не нахожу надобности выписывать здесь, но на которые я могу сослаться».

Свою задачу при изображении исторических лиц автор сформулировал в статье «Несколько слов по поводу книги “Война и мир”»: «Историк и художник, описывая историческую эпо
ху, имеют два совершенно различные предмета <…> Историк обязан иногда, пригибая истину, подводить все действия исторического лица под одну идею, которую он вложил в эт
 лицо. Художник, напротив, в самой одиночности этой идеи видит несообразность с своей задачей и старается только понять и показать не известного деятеля, а человека. Вс
 е это я говорю к тому, чтобы показать неизбежность лжи в военных описаниях, служащих материалом для военных историков, и потому показать неизбежность частых несогласий 
 художника с историком в понимании исторических событий».


Соединение “семейных” глав с развернутым описанием исторических событий, соединение в “Войне и мире” нескольких сюжетных линий, включение в ее текст многих десятков пер
сонажей были чертами совершенно новыми для современного Толстому романа. Позднейшие исследователи назвали “Войну и мир” романом-эпопеей[8 - См.: Чичерин А.В. Возникнове
ние романа-эпопеи. Изд. 2-е. М., 1975. «Эпопеей» называли толстовское сочинение уже первые рецензенты. – Гусев Н.Н. Лев Николаевич Толстой: Материалы к биографии с 1855
 по 1869 год. М., 1957. С. 823. Развернутое объяснение жанра «Войны и мира» как одновременно «семейной хроники» и «эпопеи» дал критик Н. Н. Страхов в цикле из четырех с
 татей о «Войне и мире»: Страхов Н. Н. Литературная критика. С. 263–358.].

В историко-философских главах “Войны и мира” писатель раскрывает свое понимание смысла и законов истории[9 - Историческая концепция Толстого не была неким чудачеством. В
 1868 г. автор «Войны и мира» писал историку и литератору М.П. Погодину об этих воззрениях: «взгляд на историю» – «плод всей умственной работы» его жизни и образует «нер
 аздельную часть того миросозерцания, которое Бог один знает, какими трудами и страданиями выработалось во мне <…>».]. По его мнению, исторические события определяются с
 овпадением множества причин, и потому люди не установить причины этих событий. Толстой ожесточенно и язвительно полемизирует с мнением о решающей роли великих людей – ц
 арей, полководцев, дипломатов – в истории. Чем выше место человека в обществе и в государстве, тем с большим числом обстоятельств он должен считаться, – замечает Толсто
 й. Подлинно великий человек не вмешивается в таинственный, не постижимый умом ход истории. Он только ощущает сердцем ее законы и стремится не мешать ходу событий. Именн
 о таков в изображении Толстого Кутузов, не заботящийся о военных планах, ведущий себя пассивно и рассеянно накануне решающих сражений. И именно поэтому, убеждает писате
 ль, победитель – Кутузов, а не Наполеон, тщательно разрабатывавший военные планы, но не ощущающий скрытого хода событий, забывший, что нравственная правота в войне 1812
  года – на стороне русских. Толстой отвергал историческую науку, считая ее шарлатанством. Он допускал, что движение истории определяется не волей людей, а Провидением, 
  Судьбой[10 - Однако идея Провидения была для Толстого не предметом веры или убеждения, а всего лишь гипотезой, почти метафорой, принимаемой при отсутствии иных объясне
  ний (об этом прямо сказано на страницах «Войны и мира»).Толстовская философия история не была абсолютно оригинальной и новой. Как показал Б.М. Эйхенбаум, на автора «Во
  йны и мира» повлияли идеи нескольких очень разных авторов – французского анархиста Ж. Прудона (одна из книг которого, знакомая Толстому, так и называется «Война и мир»
  ), французского консервативного мыслителя Ж. де Местра, английского историка Г. Т. Бокля, русского историка М. П. Погодина, близкого к славянофилам историка-дилетанта 
  и математика князя С.С. Урусова. – Эйхенбаум Б.М. Лев Толстой. Кн. 2. С. 281–384.Впрочем, сходство историософии Толстого с идеями Бокля, Погодина или Урусова, по-видим
  ому, не стоит преувеличивать: во многом это совпадение в частностях или в языке описания. См. об этом: Лурье Я. С. Исторический «атомизм» в «Войне и мире» // ЛурьеЯ.С.
   После Льва Толстого: Исторические воззрения Толстого и проблемы ХХ века. СПб., 1993. Я. С. Лурье показывает и отличие толстовского понимания роли народа в войне 1812 
   г. от славянофильского представления о народе: по Толстому, не мистическое начало, не религиозный подъем, а обыкновенные простые человеческие стремления, сложившись в
   оедино, привели к изгнанию армии Наполеона из России.Противоречия толстовской историософии, о которых писали критики и обыкновенно пишут исследователи, Я. С. Лурье сч
   итает мнимыми.].

В жизни «частных» людей – вымышленных персонажей – этому сверх- и внерациональному стихийному началу соответствует случай, разбивающий все ожидания. Андрей Болконский на
 поле Аустерлица снискал столь дорогую для него еще мгновение назад похвалу Наполеона – и осознал ничтожество недавнего кумира. Пьер женился на Элен, а вместо счастья об
 рел муки ревности и оскорбленного достоинства. Ранение им Долохова на дуэли внезапно вызывает не злую радость, не удовлетворение мести, но ощущение бессмысленности суще
 ствования. Вместо задуманного убийства Наполеона – в основе этого плана одержимость «наполеоновской» идеей героического поступка, как когда-то у князя Андрея – Пьер спа
 сает девочку и защищает женщину от французских солдат. Добрые поступки Пьера увенчивает отнюдь не «награда», ожидаемая читателем, привыкшим к традиционным сюжетам. Безух
 ов попадает в плен, и лишь чудо, чудо человеческого понимания и сострадания – милосердие, вдруг проявленное жестоким маршалом Даву, – спасает его от расстрела. И вот в 
 плену, на этапе происходит встреча с Платоном Каратаевым, может быть, главная в жизни Пьера. Некая высшая сила, которую принято именовать Провидением, прикрываясь личин
 ою случая, ведет героев.



О том, что Лев Толстой в «Войне и мире» опоэтизировал мир «старого барства», писали еще литературные критики – современники автора. О консерватизме общественной позиции
 Толстого, с симпатией изобразившего мир патриархального дворянства и как бы не заметившего явлений, обозначаемых штампом «ужасы крепостничества», было много сказано в 
 книгах В.Б. Шкловского и Б.М. Эйхенбаума (эти работы были изданы еще во второй половине 1920 – начале 1930-х гг.)[11 - Шкловский В. Матерьял и стиль в романе Льва Толс
 того «Война и мир». М., [1928]. С. 76–85; Эйхенбаум Б.М. Лев Толстой. Кн. 2. С. 391–394. «<…> [Социальный архаист, Толстой сатирически изображает придворную и военную 
 аристократию» <…>, а аристократию поместную, землевладельческую изображает сочувственно и <…> сливает помещика и крестьянина в одно целое» (Там же. С. 392). Здесь же – 
 анализ окликов на «Войну и мир» в «левой» и «правой» критике (роман не устраивает большинство как «левых», так и «правых» критиков). Б.М. Эйхенбаум доказывает, что соци
 альные воззрения Толстого этого периода носят отпечаток взглядов немецкого философа А. Риля.]. Но, может быть, самое интересное при изучении с этой точки зрения «Войны 
 мира» – с какими литературными произведениями при этом полемизировал писатель, какие художественные образы других авторов он словно бы истолковал по-новому в своем рома
 не.

На одну перекличку еще давно обратил внимание такой внимательный читатель и тонкий критик, как В. В. Розанов. В статье «”Горе от ума”» (1899) он заметил, что «в “Войне
 и мире”, которая имеет темою обзор и критику именно критикуемой и Грибоедовым эпохи, есть фраза» о барыне, покидающей Москву со своими арапами и шутихами – несомненны
 й отголосок слов Хлестовой о приобретенной ею «арапке»[12 - «Век нынешний и век минувший.»: Комедия А. С. Грибоедова «Горе от ума» в русской критике и литературоведен
 ии. СПб., 2002. С. 227.]. Но если в «Горе от ума» мода на «девок-арапок» подана как отвратительная черта дикого «века минувшего», то Толстой видит в упомянутой им бар
 ыне (а ее образ – собирательный) проявление столь ему дорогого «скрытого патриотизма». Такая старозаветная дворянка и ей подобные не захотели оставаться в первопресто
 
Но Розанов решил, что эта перекличка и различие в трактовке московской барыни – хозяйки «арапов» Грибоедовым и Толстым отнюдь не следствие сознательной полемики созда
теля «Войны и мира» с автором «Горя от ума»: «Мы прикидываем все это примерно; говорим, что в пьесе есть какое-то недоумение в понимании своей эпохи, как на это можно 
указать, ссылаясь на невольную критику ее в “Войне и мире” <…>»[13 - А. С. Грибоедов. «Горе от ума» в русской критике и литературоведении. СПб., 2002. С. 232.].

Спустя почти пятьдесят лет после Розанова, в 1941 г. емко и точно толстовскую трактовку грибоедовской Москвы охарактеризовала писательница из первой послереволюционной
 эмиграции Н.Н. Берберова: «Еще о “Войне и мире”.

Фамусовская Москва, с Ростовым-Фамусовым, и Тугоуховские, и Репетиловы – все налицо. Толстой как бы благословил то, что Грибоедов бичевал»[14 - Берберова Н.Н. Курсив м
ой: Автобиография. М., 1996. С. 471.].

На самом деле полемика в изображении «старого барства» есть: Толстой полемизирует – причем вполне осознанно – не только с Грибоедовым, но и еще со многими произведения
ми русской литературы, в которых отражены взгляды, которые – не ища более точных определений – можно назвать либеральными и прогрессистскими.

Вот пассаж из третьего тома «Войны и мира»: «Та барыня, которая еще в июне месяце с своими арапами и шутихами поднималась из Москвы в саратовскую деревню, с смутным с
ознанием того, что она Бонапарту не слуга, и со страхом, чтобы ее не остановили по приказанию графа Растопчина, делала просто и истинно то великое дело, которое спасло
 Россию» (т. 3, ч. 3, гл. V).


А в какой пьесе Грибоедова старуха Хлестова вспоминает о своей чернокожей служанке: «Какая у меня арапка для услуг: / Курчавая! горбом лопатки! / Сердитая! все кошач
ьи ухватки! / Да как черна! да как страшна!»

Рассказ Хлестовой весьма красноречив. Прежде всего, эта большая барыня вместе с сестрой (им обоим достал слуг-«арапов» угодливый Загорецкий) привержена старинной мод
е прошлого, «минувшего» века на чернокожих слуг. Хлестова – одна из тех, о ком в финале Чацкий скажет как о «старухах зловещих, стариках, / Дряхлеющих над выдумками, 
вздором» (д. 4, явл. 14). Кроме того, отношение к «арапам» как к полулюдям-полуживотным свидетельствует о «варварстве», «дикости» этого грибоедовского персонажа. И, н
аконец, Хлестова ради желания иметь служанку-«арапку» готова прибегнуть к услугам такого отвратительного человека, как Загорецкий. Она безнравственна.

Между тем у Толстого владение «арапами» – не более чем историческая деталь, признак времени. Сама по себе она не говорит о человеке ни хорошо, ни плохо. Хозяйка черно
кожей прислуги может быть истинной патриоткой.

Полемические переклички с «Горем от ума» в этом фрагменте толстовского романа очевидны. Московская барыня не случайно направляется именно в саратовскую деревню: «в де
ревню, к тетке, в глушь, в Саратов» грозится отослать Софью Фамусов. Безымянная барыня из толстовского романа оказывается едва ли не Софьиной тетушкой.

И еще о слугах. Среди слуг старого графа Ильи Андреевича Ростова имеется шут по прозвищу Настасья Ивановна. Для либерального сознания шуты – бесспорное свидетельство б
есчеловечности и развращенности их господ, попирающих человеческое достоинство слуг, вынужденных играть эту унизительную роль. «Гаеры», шуты – одна из отвратительных ч
ерт крепостнического быта в некрасовском стихотворении «Родина». У Толстого же и это – выразительная и даже экзотически милая черта старинных нравов. А шут Настасья Ив
ановна отнюдь не чувствует себя униженным.

Грибоедовская Хлестова отличается прежде всего бесцеремонностью и резкостью. О Чацком она прилюдно замечает: «Я за уши его дирала, только мало». В «Войне и мире» ест
ь подобная бесцеремонная московская дама, Марья Дмитриевна Ахросимова. Но только не в пример Хлестовой она добра и мудра, именно она предотвращает увоз Наташи Анатолем
 Курагиным, она выносит резкий приговор безнравственному замыслу Элен выйти замуж при живом муже, Пьере Безухове. Злоязычная и грубоватая, но справедливая, Ахросимова 
 оказывается в великосветском Петербурге в том же положении, что и Чацкий в старозаветной Москве: в обоих видят «шутов».

В своей комедии Грибоедов направил всю желчь сатиры и соль острот против патриархальной Москвы, приравняв патриархальность к «дикости». Толстой же дорожил естественнос
тью в старинных нраве и быте, по контрасту низко оценивая великосветский Петербург, чопорный, лицемерный, мертвенный: «В числе бесчисленных подразделений, которые можно
 сделать в явлениях жизни, можно подразделить их все на такие, в которых преобладает содержание, другие – в которых преобладает форма. К числу таковых, в противоположн
 ость деревенской, земской, губернской, даже московской жизни, можно отнести жизнь петербургскую, в особенности салонную. Эта жизнь неизменна» (т. 3, ч. 2, гл. VI).

Вот хлебосольный московский барин, милый в своей простоте и безалаберности старый граф Ростов радостно внимает всем ораторам в московском Дворянском собрании в 1812 г
. и не замечает, что они противоречат друг другу: «<…> только Илья Андреич был доволен речью Пьера, как он был доволен речью моряка, сенатора и вообще всегда тою речь
ю, которую он последнею слышал» (т. 3, ч. 1, гл. XXII). Чем не Павел Афанасьевич Фамусов, завсегдатай Английского клуба? Только хороший Фамусов.

Да и сам автор, не боясь обвинений в ретроградстве и косности, готов подать себя этаким симпатичным Фамусовым или Скалозубом: «Только в наше самоуверенное время попул
яризации знаний, благодаря сильнейшему орудию невежества – распространению книгопечатания вопрос о свободе воли сведен на такую почву, на которой и не может быть самог
о вопроса. В наше время большинство так называемых передовых людей, то есть толпа невежд <…>» (Эпилог, ч. 2, гл. VIII). Книги сжечь или фельдфебеля в Волтеры дать созд
атель «Войны и мира» не предлагает, но просвещение, перед которым благоговел Чацкий, не жалует.

Чем заняты любимые автором Ростовы? Одно из самых дорогих их душе занятий – псовая охота. Охотятся с размахом: «Всех гончих выведено было пятьдесят четыре собаки, под

О поэтизации Толстым псовой охоты резко отозвался Д.И. Писарев, увидев в охотничьем азарте отказ человека от общественных задач и от решения серьезных жизненных вопро
сов: «Кто не останавливается на веселой наружности явлений, того шумная и оживленная сцена охоты наведет на самые печальные размышления. Если такая малость, такая дря
нь, как борьба волка с несколькими собаками, может доставить человеку полный комплект сильных ощущений, от исступленного отчаяния до безумной радости, со всеми промеж
уточными полутонами и переливами, то зачем же этот человек будет заботиться о расширении и углублении своей жизни? Зачем ему искать себе работы, зачем ему создавать с
ебе интересы в обширном и бурном море общественной жизни, когда конюшня, псарня и ближайший лес с избытком удовлетворяют всем потребностям его нервной системы?»[15 - 
Война из-за “Войны и мира”. С. 94.]

После охоты Ростовы приезжают в дом к дядюшке: «Через переднюю дядюшка провел своих гостей в маленькую залу с складным столом и красными стульями, потом в гостиную с б
ерезовым круглым столом и диваном, потом в кабинет с оборванным диваном, истасканным ковром и с портретами Суворова, отца и матери хозяина и его самого в военном мун
дире. В кабинете слышался сильный запах табаку и собак.

В кабинете дядюшка попросил гостей сесть и расположиться как дома, а сам вышел. Ругай с невычистившейся спиной вошел в кабинет и лег на диван, обчищая себя языком и з
убами» (ч. 4, гл. VII). Вглядимся в эту жанровую сцену. Дядюшка – внешне почти вылитый господин Ноздрев из поэмы Н.В. Гоголя «Мертвые души»: «Вошедши во двор, увидел
и там всяких собак, и густопсовых, и чистопсовых, всех возможных цветов и мастей, муругих, черных с подпалинами, полно-пегих, муруго-пегих, красно-пегих, черноухих, 
сероухих. Тут были все клички, все повелительные наклонения: стреляй, обругай, порхай, пожар, скосырь, черкай, допекай, припекай, северга, касатка, награда, попечите
льница. Ноздрев был среди их совершенно как отец среди семейства; все они, тут же пустивши вверх хвосты, зовомые у собак правилами, полетели прямо навстречу гостям и
 стали с ними здороваться. Штук десять из них положили своим лапы Ноздреву на плечи. Обругай оказал такую же дружбу Чичикову и, поднявшись на задние ноги, лизнул его
  языком в губы, так что Чичиков тут же выплюнул. Осмотрели собак, наводивших изумление крепостью черных мясов, – хорошие были собаки. Потом пошли осматривать крымск
  ую суку, которая была уже слепая и, по словам Ноздрева, должна была скоро издохнуть, но года два тому назад была очень хорошая сука; осмотрели и суку – сука, точно
  , была слепая» (т. 1, гл. 4).

Собаки дядюшки Ростовых, правда, не ведут себя так панибратски с гостями, как ноздревские с Чичиковым; но зато у Ноздрева на диване не лежат. Любимая собака дядюшки 
Ростовых, кобель Ругай, почти тезка гоголевскому Обругаю.

Однако сходство двух сцен – поверхностное. У Гоголя смешавшиеся в кучу собаки и люди – свидетельство «оскотинивания», духовного падения человека, у Толстого – это с
импатичная черта патриархального поместного быта, и только.

Особенно выразителен как вызов либеральным воззрениям в «Войне и мире» образ Николая Ростова – помещика.

«Николай был хозяин простой, не любил нововведений, в особенности английских, которые входили тогда в моду, смеялся над теоретическими сочинениями о хозяйстве, не л
юбил заводов, дорогих производств, посевов дорогих хлебов и вообще не занимался отдельно ни одной частью хозяйства. У него перед глазами всегда было только одно имен
ье, а не какая-нибудь отдельная часть его. В именье же главным предметом был не азот и не кислород, находящиеся в почве и воздухе, не особенный плуг и назем, а то гл
авное орудие, посредством которого действует и азот, и кислород, и назем, и плуг – то есть работник-мужик.

И только тогда, когда он понял вкусы и стремления мужика, научился говорить его речью и понимать тайный смысл его речи, когда почувствовал себя сроднившимся с ним, т
олько тогда стал он смело управлять им, то есть исполнять по отношению к мужикам ту самую должность, исполнение которой от него требовалось. И хозяйство Николая прин
осило самые блестящие результаты» (Эпилог, ч. 1, гл. II).

Николай Ростов – ярый «антиреформатор» в ведении хозяйства. Его взгляды на сей счет (справедливость которых доказана на практике) – разительный контраст и нововведени
ям Онегина, заменившего «ярем барщины старинной» «оброком легким», и бесплодным реформам Николая Петровича Кирсанова из тургеневских «Отцов и детей».

На словах Ростов не любит русского мужика: «Он часто говаривал с досадой о какой-нибудь неудаче или беспорядке: “С нашим русским народом”, – и воображал себе, что он 
терпеть не может мужика.

Но он всеми силами души любил этот наш русский народ и его быт и потому только понял и усвоил себе тот единственный путь и прием хозяйства, которые приносили хорошие
 результаты».

Эта внешняя нелюбовь при настоящей, глубинной, – как они непохожи на показное «мужиколюбие» Павла Петровича Кирсанова из «Отцов и детей», который даже держит на столи
ке серебряную пепельницу в форме лаптя.

Ни Пушкин, приветствовавший нововведения Онегина («И раб судьбу благословил»), ни Тургенев не писали о любви мужиков к господам. Толстой решился и на это: «И, должно 
быть, потому, что Николай не позволял себе мысли о том, что он делает что-нибудь для других, для добродетели, – все, что он делал, было плодотворно: состояние его бы
стро увеличивалось; соседние мужики приходили просить его, чтобы он купил их, и долго после его смерти в народе хранилась набожная память об его управлении. “Хозяин б
ыл… Наперед мужицкое, а потом свое. Ну, и потачки не давал. Одно слово – хозяин!”» (Эпилог, ч. 1, гл. VII).

Он «простил» Николаю Ростову даже то, что либеральная мысль и словесность почитали неискупимым, неизбывным грехом, тягчайшим преступлением, – рукоприкладство по отнош
ению к мужикам (у Толстого это управляющий из мужиков).

«Одно, что мучило Николая по отношению к его хозяйничанию, это была его вспыльчивость в соединении с старой гусарской привычкой давать волю рукам. В первое время он н
е видел в этом ничего предосудительного, но на второй год своей женитьбы его взгляд на такого рода расправы вдруг изменился.

Однажды летом из Богучарова был вызван староста <…>, обвиняемый в разных мошенничествах и неисправностях. Николай вышел к нему на крыльцо, и с первых ответов старосты
 в сенях послышались крики и удары. <…>

Эдакой наглый мерзавец, – говорил он, горячась при одном воспоминании. – Ну, сказал бы он мне, что был пьян, не видал. Да что с тобой, Мари? – вдруг спросил он» (Эпил
ог, ч. 1, гл. VIII).

Жена упрекает мужа в таких поступках. Не одобряет, конечно, и Толстой. Но Николай не всегда может сдержать себя, и автор не судит строго за это своего героя: «С тех п
ор, как только при объяснениях со старостами и приказчиками кровь бросалась ему в лицо и руки начинали сжиматься в кулаками, Николай вертел разбитый перстень на пальц
е и опускал глаза перед человеком, рассердившим его. Однако же раза два в год он забывался и тогда, придя к жене, признавался и опять давал обещание, что уже теперь э
то было в последний раз.

– Мари, ты, верно, меня презираешь? – говорил он ей. – Я стою этого.

– Ты уйди, уйди поскорее, ежели чувствуешь себя не в силах удержаться, – с грустью говорила графиня Марья, стараясь утешить мужа» (Эпилог, ч. 1, гл. VIII).

Конечно, «Война и мир» – это отнюдь не просто запоздалая апология «старого барства». Но понять роман Толстого без учета противостояния автора влиятельной «либеральной
» традиции в отечественной словесности невозможно. Иначе происходит неизменное упрощение смысла этого произведения и позиции его создателя.

Противопоставляя себя – демонстративно, почти эпатирующим образом – радикальному демократическому движению, Толстой, тем не менее, оказывался не столь уж далек от ниг
илизма. Отрицание официальной истории созвучно установке написанной и изданной в одно время с «Войной и миром» «Истории одного города» М. Е. Салтыкова-Щедрина. Отрица
ние условности, знаковости (восприятие оперы остранняющим взглядом «естественной» героини Наташи Ростовой, именование знамен тряпками на палках и многое прочее[16 - У
 Толстого к условностям, фантомным ценностям цивилизации отнесена и медицина (Пьер после лишений плена выздоровел, поскольку не лечился у докторов). С этим нигилисты-
 поклонники естественных наук, конечно бы, не согласились.]). Наконец, даже понимание призвания и воспевание женщины только как жены и матери (Наташа в эпилоге) вовсе
  не чуждо радикальной мысли. Представления Толстого здесь созвучны идеям популярного в нигилистических кругах Ж. Прудона, совсем не борца за эмансипацию женщин, выск
  азанным в посмертно изданной книге «Порнократия, или Женщины в настоящее время»[17 - Прудон Ж. Что такое собственность? М., 1998. С. 270–275.].

«Благодаря <…> своеобразному своему положению в современности Толстой примкнул одной стороной своего романа к “обличительному” направлению и был истолкован как “нигил
ист”, как представитель левой “нетовщины”, а другой – оказался среди “крепостников”, среди представителей “старого барства”»[18 - Эйхенбаум Б. М. Лев Толстой. Кн. 2.].



«Рецензии на “Войну и мир” похожи сейчас на хулиганство. Никто (кроме Страхова) ничего не понял», – писала о восприятии романа в критике Л.Я. Гинзбург[19 - Гинзбург Л
.Я. Литература в поисках реальности. Л., 1987. С. 114.]. Исследовательница почти не преувеличивала. Книга имела громадный успех, но рецензенты не могли, а, как правил
о, и не желали (по причинам идеологическим) его объяснить. Отмечая успех романа, литератор и поэт радикального направления Д.Д. Минаев добавлял: «Пусть другие радуютс
я, коли есть охота, но в сущности радоваться тут решительно нечему»[20 - Дело. 1868. № 4. Отд. II. С. 202.]. Д. И. Писарев, высоко оценивая талант писателя, судит неу
молимым судом его героев: для критика автор «Войны и мира» только певец «старого барства», а ценность романа в том, что правда жизни победила авторскую идею: «старое 
барство» бесплодно и достойно лишь гримасы отвращения. М.К. Цебрикова перевела разговор на вопрос о женской эмансипации, с сожалением отметив, что Наташа не дотягивае
 до девиц-эмансипе. Н.В. Шелгунов изобличал ретроградные историософские взгляды Толстого: «“Война и мир”, в сущности, – славянофильский роман, в котором напутаны правд
 а с ложью, наука с невежеством, благо со злом, прогресс с отсталостью. Это какая-то смесь немногого хорошего со многим дурным, возводящая графа Пьера в руководящий и
 деал, долженствующий обновить и просветить Россию. Только будет ли лучше, если судьбами России будут управлять такие умные люди?»[21 - Война из-за «Войны и мира». С.
  352. Здесь же перепечатаны статьи Д. И. Писарева и М. К. Цебриковой.]

В. В. Берви-Флеровский, писавший под псевдонимом С. Навалихин, утверждал: «Читая военные сцены романа, постоянно кажется, что ограниченный, но речистый унтер-офицер 
рассказывает о своих впечатлениях в глухой и наивной деревне». Князя Андрея критик аттестует как «цивилизованного бушмена» (у Болконского «тряпичный ум»), а Николая 
Ростова – как «одного из “изящных бушменов”»[22 - Дело. 1868. № 6. Отд. II. С. 25–26, 12, 18.].

В радикальной сатирической «Искре» печатались рисунки-карикатуры на героев романа с подписями гекзаметром – стихом античных героических поэм. Например, такая: «Гости
 уж все собрались – и на блюде горячем / Виконт де Мортмарт был предложен. / Не бойтесь, детки, кушать его ведь не будут. / Это сравненье – в эстетической сказке сво
 ей эстетике дань отдаю я»[23 - Ср. воспроизведение пародийных иллюстраций и рисунков в кн.: Шкловский В. Матерьял стиль в романе Льва Толстого «Война и мир». Вклейк
 а между с. 208 и 209. Пародируется сравнение представляемого Анной Павловной Шерер гостя-виконта с блюдом, которым сервируют стол (начало романа).Сестра С.А. Толсто
 й, Т. А. Кузминская, передает (со слов супруга) желчные замечания М.Е. Салтыкова-Щедрина: «“Эти военные сцены – одна ложь и суета. Багратион и Кутузов – кукольные г
 енералы. А вообще – болтовня нянюшек и мамушек. А вот наше, так называемое, “высшее общество” граф лихо прохватил.”». – Кузминская Т.А. Моя жизнь дома и в Ясной Поля
 не. Тула, 1976. С. 338.Отзывы либерала Тургенева были неоднозначными: признавая мастерство Толстого, он сетовал в письмах на чрезмерную детализацию переживаний геро
 ев и на любовь к «мелочам» – в жестах, в манере поведения, в одежде персонажей (статья «По поводу “Отцов и детей”» [1869], письмо П. Борисову [1870]).].

Голоса из правого лагеря были также, по большей части, враждебными: «в романе собраны только все скандальные анекдоты военного времени той эпохи»[24 - Норов А.С. Вой
на и мир (1805–1812) с исторической точки зрения и по воспоминаниям совпременников. СПб., 1868. С. 2.]; «[э]то уже не скептицизм, а чисто нравственно-литературный ма
териализм. Безбожие опустошает небо и будущую жизнь. Историческое вольнодумство и неверие опустошают землю и жизнь и настоящего отрицанием событий минувшего и отреше
нием народных личностей <…> В упомянутой книге трудно решить и даже догадываться, где кончается история и где начинается роман, и обратно. Это переплетение, или, скор
ее, перепутывание истории и романа, без сомнения, вредит первой и окончательно, перед судом здравой и беспристрастной критики, не возвышает истинного достоинства посл
еднего, т. е. романа[25 - Вяземский П. А. Воспоминания о 1812 годе // Русский архив. 1869. № 1. С. 186–187.]».

И Норов, и Вяземский уличали автора «Войны и мира» в сознательном искажении истории, в клевете на нее.

Критики, отрешившиеся от идеологического приговора и выделившие основные художественные особенности романа (П. В. Анненков, Н.И. Соловьев), оценили их скорее как нед
остатки, чем как достоинства: ведь «Война и мир» разительно не соответствовала канону исторического романа[26 - Статьи переизданы в книге «Война из-за “Войны и мира”».].

Цикл статей Н.Н. Страхова действительно отчетливо выделяется на этом фоне[27 - Обзор откликов критиков на «Войну и мир» см. в статье: Сухих И. Н. Война и мир вокруг
 «Войны и мира» / / Война из-за «Войны и мира». С. 32.].

Лишь со временем были по-настоящему осознаны грандиозность и величие этой в высшей степени оригинальной толстовской книги.

А. М. Ранчин




Том первый





Часть первая





I


– Eh bien, mon prince. G?nes et Lucques ne sont plus que des apanages, des поместья, de la famille Buonaparte. Non, je vous previens, que si vous ne me dites pas, 
que nous avons la guerre, si vous vous permettez encore de pallier toutes les infamies, toutes les atrocitеs de cet Antichrist (ma parole, j'y crois) – je ne voue 
connais plus, vous n'?tes plus mon ami, vous n'?tes plus мой верный раб, comme vous dites[28 - Ну, князь, Генуя и Лукка – поместья фамилии Бонапарте. Нет, я вам вп
еред говорю, если вы мне не скажете, что у нас война, если вы еще позволите себе защищать все гадости, все ужасы этого Антихриста (право, я верю, что он Антихрист)
, – я вас больше не знаю, вы уж не друг мой, вы уж не мой верный раб, как вы говорите (фр.) <Переводы, за исключением специально отмеченных, принадлежат Л.Н. Толст
ому; переводы с французского языка не оговариваются.>.]. Ну, здравствуйте, здравствуйте. Je vois que je vous fais peur[29 - Я вижу, что я вас пугаю.], садитесь и р
ассказывайте.

Так говорила в июле 1805 года известная Анна Павловна Шерер, фрейлина и приближенная императрицы Марии Феодоровны, встречая важного и чиновного князя Василия, перв
ого приехавшего на ее вечер. Анна Павловна кашляла несколько дней, у нее был грипп, как она говорила (грипп был тогда новое слово, употреблявшееся только редкими). 
В записочках, разосланных утром с красным лакеем, было написано без различия во всех:



“Si vous n'avez rien de mieux ? faire, Monsieur le comte (или mon prince), et si la perspective de passer la soirеe chez une pauvre malade no vous effray pas trop,
 je serai charmеe de vous voir chez moi entre 7 et 10 heures. Annette Scherer’[30 - Если у вас, граф (или князь), нет в виду ничего лучшего и если перспектива вече
 ра у бедной больной не слишком вас пугает, то я буду очень рада видеть вас нынче у себя между семью и десятью часами. Ан на Шерер.].


– Dieu, quelle virulente sortie![31 - Господи, какое горячее нападение!] – отвечал, нисколько не смутясь такою встречей, вошедший князь, в придворном, шитом мундир
е, в чулках, башмаках и звездах, с светлым выражением плоского лица.

Он говорил на том изысканном французском языке, на котором не только говорили, но и думали наши деды, и с теми тихими, покровительственными интонациями, которые сво
йственны состарившемуся в свете и при дворе значительному человеку. Он подошел к Анне Павловне, поцеловал ее руку, подставив ей свою надушенную и сияющую лысину, и п
окойно уселся на диване.

– Avant tout dites moi, comment vous allez, ch?re amie?[32 - Прежде всего скажите, как ваше здоровье, милый друг.] Успокойте меня, – сказал он, не изменяя голоса и 
тоном, в котором из-за приличия и участия просвечивало равнодушие и даже насмешка.

– Как можно быть здоровой… когда нравственно страдаешь? Разве можно, имея чувство, оставаться спокойною в наше время? – сказала Анна Павловна. – Вы весь вечер у ме
ня, надеюсь?

– А праздник английского посланника? Нынче середа. Мне надо показаться там, – сказал князь. – Дочь заедет за мной и повезет меня.

– Я думала, что нынешний праздник отменен. Je vous avoue que toutes ces f?tes et tous ces feux d'artifice commencent ? devenir insipides[33 - Признаюсь, все эти пр
аздники и фейерверки становятся несносны.].

– Ежели бы знали, что вы этого хотите, праздник бы отменили, – сказал князь, по привычке, как заведенные часы, говоря вещи, которым он и не хотел, чтобы верили.

– Ne me tourmentez pas. Eh bien, qu'a-t-on dеcidе par rapport ? la dеp?che de Novosilzoff? Vous savez tout[34 - Не мучьте меня. Ну, что же решили по случаю депеши 
Новосильцева? Вы всё знаете.].

– Как вам сказать? – сказал князь холодным, скучающим тоном. – Qu'a-t-on dеcidе? On a dеcidе que Buonaparte a br?lе ses vaisseaux, et je crois que nous sommes en t
rain de br?ler les notres[35 - Что решили? Решили, что Бонапарте сжег свои корабли, и мы тоже, кажется, готовы сжечь наши.].

Князь Василий говорил всегда лениво, как актер говорит роль старой пиесы. Анна Павловна Шерер, напротив, несмотря на свои сорок лет, была преисполнена оживления и 
порывов.

Быть энтузиасткой сделалось ее общественным положением, и иногда, когда ей даже того не хотелось, она, чтобы не обмануть ожиданий людей, знавших ее, делалась энтуз
иасткой. Сдержанная улыбка, игравшая постоянно на лице Анны Павловны, хотя и не шла к ее отжившим чертам, выражала, как у избалованных детей, постоянное сознание 
своего милого недостатка, от которого она не хочет, не может и не находит нужным исправляться.

В середине разговора про политические действия Анна Павловна разгорячилась.

– Ах, не говорите мне про Австрию! Я ничего не понимаю, может быть, но Австрия никогда не хотела и не хочет войны. Она предает нас. Россия одна должна быть спасит
ельницей Европы. Наш благодетель знает свое высокое призвание и будет верен ему. Вот одно, во что я верю. Нашему доброму и чудному государю предстоит величайшая ро
ль в мире, и он так добродетелен и хорош, что Бог не оставит его, и он исполнит свое призвание задавить гидру революции, которая теперь еще ужаснее в лице этого уб
ийцы и злодея. Мы одни должны искупить кровь праведника. На кого нам надеяться, я вас спрашиваю?.. Англия с своим коммерческим духом не поймет и не может понять вс
ю высоту души императора Александра. Она отказалась очистить Мальту. Она хочет видеть, ищет заднюю мысль наших действий. Что они сказали Новосильцеву? Ничего. Они 
не поняли, они не могут понять самоотвержения нашего императора, который ничего не хочет для себя и все хочет для блага мира. И что они обещали? Ничего. И что обеща
ли, и того не будет! Пруссия уже объявила, что Бонапарте непобедим и что вся Европа ничего не может против него… И я не верю ни в одном слове ни Гарденбергу, ни Гау
гвицу. Cette fameuse neutralitе prussienne, ce n'est qu'un pi?ge[36 - Этот пресловутый нейтралитет Пруссии – только западня.]. Я верю в одного Бога и в высокую судь
бу нашего милого императора. Он спасет Европу!.. – Она вдруг остановилась с улыбкой насмешки над своею горячностью.

– Я думаю, – сказал князь, улыбаясь, – что, ежели бы вас послали вместо нашего милого Винценгероде, вы бы взяли приступом согласие прусского короля. Вы так красноре
чивы. Вы дадите мне чаю?


– Сейчас. A propos, – прибавила она, опять успокоиваясь, – нынче у меня два очень интересные человека, le vicomte de Mortemart, il est alliе aux Montmorency par le
s Rohans[37 - Кстати, – виконт Мортемар, он в родстве с Монморанси через Роганов.], одна из лучших фамилий Франции. Это один из хороших эмигрантов, из настоящих. И 
потом l'abbе Morio[38 - аббат Морио.]; вы знаете этот глубокий ум? Он был принят государем. Вы знаете?

– А! Я очень рад буду, – сказал князь. – Скажите, – прибавил он, как будто только что вспомнив что-то и особенно-небрежно, тогда как то, о чем он спрашивал, было г
лавной целью его посещения, – правда, что l'impеratrice-m?re[39 - вдовствующая императрица.] желает назначения барона Функе первым секретарем в Вену? C'est un pauv
re sire, ce baron, ? ce qu'il para?t[40 - Барон этот ничтожное существо, как кажется.]. – Князь Василий желал определить сына на это место, которое через императр
ицу Марию Феодоровну старались доставить барону.
"""
fri={'а': 8.01, 'б': 1.59, 'в': 4.54, 'г': 1.7, 'д': 2.98, 'е': 8.45, 'ё': 0.04, 'ж': 0.94, 'з': 1.65, 'и': 7.35, 'й': 1.21, 'к': 3.49, 'л': 4.4, 'м': 3.21, 'н': 6.7, 'о': 10.97, 'п': 2.81, 'р': 4.73, 'с': 5.47, 'т': 6.26, 'у': 2.62, 'ф': 0.26, 'х': 0.97, 'ц': 0.48, 'ч': 1.44, 'ш': 0.73, 'щ': 0.36, 'ъ': 0.04, 'ы': 1.9, 'ь': 1.74, 'э': 0.32, 'ю': 0.64, 'я': 2.01}

def bi_def(txt):
    bi_dict,c={},0
    for i in range(len(txt) - 1):
            if(txt[i] + txt[i + 1] not in bi_dict):
                bi_dict[txt[i] + txt[i + 1]] = 1
            else:
                bi_dict[txt[i] + txt[i + 1]] += 1
            c+=1
    for k,v in bi_dict.items():
        bi_dict[k] = 100 * v / c
    return bi_dict

def Bi_fri(enc_bi_dic, bi_dic):
    dec_alpha = {}
    enc = sorted(enc_bi_dic.items(), key=lambda x: x[1])
    dec = sorted(bi_dic.items(), key=lambda x: x[1])
    for i in range(len(enc)):
        dec_alpha[enc[i][0]] = dec[i][0]

    return dec_alpha

def Mono(frir):
    dec_alpha = {}
    for k, v in frir.items():
        buf, min_val, min_key = {}, 200, ""
        for kf, vf in fri.items():
            buf[kf] = abs(vf - v)
            for key, val in buf.items():
                if val <= min_val:
                    min_val = val
                    min_key = key
        dec_alpha[k] = min_key

    return dec_alpha


def Tru_dec(enc_bi_dic, bi_dic, frir):
    dec_alpha = Bi_fri(enc_bi_dic, bi_dic)
    for k, v in enc_bi_dic.items():
        buf, min_val, min_key = {}, 200, ""
        for kf, vf in bi_dic.items():
            buf[kf] = abs(vf - v)
            for key, val in buf.items():
                if (k[0] == " " and key[0] == " ") or (k[1] == " " and key[1] == " ") or (k[1] != " " and key[0] != " " and k[0] != " " and key[1] != " "):
                    if val <= min_val:
                        min_val = val
                        min_key = key
        if min_val<abs(v-bi_dic[dec_alpha[k]]) and abs(v-bi_dic[dec_alpha[k]]) - min_val>=0.0075:
            if min_val >= 0.02:
                for k_m, v_m in frir.items():
                    buf_m, min_val_m0, min_key_m0, min_val_m2, min_key_m2 = {}, 200, "", 200, ""
                    if k_m == k[0]:
                        for kf_m, vf_m in fri.items():
                            buf[kf_m] = abs(vf_m - v_m)
                            for key_m, val_m in buf_m.items():
                                if val_m <= min_val_m0 and key_m:
                                    min_val_m0 = val_m
                                    min_key_m0 = key_m
                    elif k_m == k[1]:
                        for kf_m, vf_m in fri.items():
                            buf[kf_m] = abs(vf_m - v_m)
                            for key_m, val_m in buf_m.items():
                                if val_m <= min_val_m2 and key_m:
                                    min_val_m2 = val_m
                                    min_key_m2 = key_m
                min_key = min_key_m0 + min_key_m2
            dec_alpha[k] = min_key

    return dec_alpha

def Fri_decrip(enc_text, bi_dic):
    textf = ""
    textf += enc_text
    textf = textf.replace(" ", "")
    frir, c = {}, 0
    for i in textf:
        if i in frir:
            frir[i] += 1
        else:
            frir[i] = 1
        c += 1
    for k, v in frir.items():
        frir[k] = 100 * v / c
    enc_bi_dic = bi_def(enc_text)

    enc_text2=""
    enc_text2+=enc_text

    dec_alpha2 = Mono(frir)

    for i in range(len(enc_text2) - 1):
        for k, v in dec_alpha2.items():
            if enc_text2[i] == k:
                a = enc_text2[:i]
                b = enc_text2[i + 1:]
                enc_text2 = a + v + b
                break
    print("Анализ монограммами: ",enc_text2)

    dec_alpha = Tru_dec(enc_bi_dic, bi_dic, frir)

    for i in range(0, (len(enc_text) - 2), 2):
        for k, v in dec_alpha.items():
            if enc_text[i:i + 2] == k:
                a = enc_text[:i]
                b = enc_text[i + 2:]
                enc_text = a + v + b
                break

    #print(dec_alpha)
    return enc_text


def Cesar(w,d,k,dic):
    cesar_alphabet="абвгдеёжзийклмнопрстуфхцчшщъыьэюя"
    for i in k:
        cesar_alphabet=cesar_alphabet.replace(i,"")
    a=cesar_alphabet[-d:]+cesar_alphabet[:-d]
    cesar_alphabet=a[:d]+k+a[d:]
    encripted=""
    for i in w:
        encripted+=cesar_alphabet[dic[i]]
    return  encripted


def Cesar_mod(w,k,dic):
    cesar_mod_alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"
    under_word,c="",0
    for i in w:
        under_word+=k[c%len(k)]
        c+=1
    encripted = ""
    for i in range(len(w)):
        encripted += cesar_mod_alphabet[(dic[w[i]]+"абвгдеёжзийклмнопрстуфхцчшщъыьэюя".find(under_word[i]))%32]
    return encripted

def prepare(text):
    text = text.lower()
    text = text.replace("     ", " ")
    text = text.replace("    ", " ")
    text = text.replace("   ", " ")
    text = text.replace("  ", " ")
    text = text.replace(" г.", "")
    for i in text:
        if i in """»1«!234567890-=+_)–(*&^%$#@"№;%:?*()'/\|][}{’.,<>?Qq…Ww–E”eRrTtYyUuIiOoPpAaSsDdFfGgHhJjKkLlZzxxCcVvBbNnMmÄäÜ“üÖöß —\n""":
            text = text.replace(i, "")
    return text

alphabet="абвгдеёжзийклмнопрстуфхцчшщъыьэюя"
text=text1
text=prepare(text)
print("Введите смещение: ")
delta=int(input())
print("Введите ключ: ")
key=input().lower()
text_list=text.split()
encripted=""
for i in text_list:
    word_dict = {}
    for j in i:
        if j in alphabet:
            word_dict[j]=alphabet.find(j)
    encripted += Cesar(i, delta, key, word_dict) + " "

print("Исходный текст: ",text)
print("Зашифрованный текст: ",encripted)
decr=prepare(Fri_decrip(encripted, bi_def(text)))
print("Анализ и моно- и би- граммами: ",decr)